{
	"basics": {
		"name": "Kenneth Kebaara",
	"label": "Full-Stack Software Developer, Data Analyst & Technology Entrepreneur",
		"picture": "images/Kenneth Kebaara.png",
		"email": "kkebaara@yahoo.com",
		"phone": "720-967-9178",
		"website": "https://kebaara.com",
	"summary": "<p>Dynamic full-stack software developer, data analyst, and technology entrepreneur with 10+ years of experience architecting scalable web and mobile applications. Expertise spans React Native, Firebase, Ruby on Rails, modern JavaScript frameworks, and advanced data analytics.</p><p>As founder of USA2Kenya and co-founder of WellVue, I deliver innovative, user-focused solutions that seamlessly connect technology with business strategy. Passionate about solving real-world challenges and creating applications that drive user engagement and accelerate business growth.</p><p>Specialize in building cross-platform mobile applications, scalable web platforms, and data-driven solutions that transform businesses and enhance user experiences.</p>",
		"location": {
			"address": "",
			"postalCode": "80205",
			"city": "Denver",
			"countryCode": "USA",
			"region": "Colorado"
		},
		"profiles": [
			{
				"network": "github",
				"username": "kkebaara",
				"url": "http://github.com/kkebaara"
			},
			{
				"network": "linkedin",
				"username": "kkebaara",
				"url": "http://linkedin.com/in/kkebaara"
			},
			{
				"network": "twitter",
				"username": "kkebaara",
				"url": "http://twitter.com/kkebaara"
			},
			{
				"network": "instagram",
				"username": "kkebaara",
				"url": "http://instagram.com/Kebaara"
			}
		]
	},
	"interests": [
		{
			"name": "Software Engineering",
			"keywords": ["Full-Stack Development", "Mobile Applications", "Web Development"]
		},
		{
			"name": "Technology Innovation",
			"keywords": ["React Native", "Firebase", "Cloud Computing", "API Development"]
		},
		{
			"name": "Entrepreneurship",
			"keywords": ["Startups", "Business Development", "Product Strategy", "MVP Development"]
		},
		{
			"name": "User Experience Design",
			"keywords": ["UI/UX", "Product Design", "User Research", "Prototyping"]
		},
		{
			"name": "Emerging Technologies",
			"keywords": ["AI/ML Integration", "Progressive Web Apps", "Microservices"]
		}
	],

	"skills": [
		{
			"name": "Frontend Technologies",
			"level": "Expert",
			"keywords": ["React", "React Native", "JavaScript", "TypeScript", "HTML5", "CSS3", "SASS/SCSS", "Responsive Design", "Progressive Web Apps", "Webpack", "Babel"]
		},
		{
			"name": "Backend Technologies",
			"level": "Expert", 
			"keywords": ["Ruby on Rails", "Node.js", "Express.js", "RESTful APIs", "GraphQL", "Microservices", "Serverless Functions", "API Design", "Authentication & Authorization"]
		},
		{
			"name": "Database & Cloud",
			"level": "Advanced",
			"keywords": ["Firebase", "PostgreSQL", "MySQL", "MongoDB", "Redis", "AWS (EC2, S3, Lambda)", "Google Cloud Platform", "Heroku", "DigitalOcean"]
		},
		{
			"name": "Mobile Development",
			"level": "Expert",
			"keywords": ["React Native", "iOS", "Android", "Cross-platform", "App Store Deployment", "Push Notifications", "Mobile Analytics", "App Performance Optimization"]
		},
		{
			"name": "Development Tools",
			"level": "Advanced",
			"keywords": ["Git", "GitHub", "BitBucket", "VS Code", "Xcode", "Android Studio", "Docker", "CI/CD", "Jest", "Testing Frameworks"]
		},
		{
			"name": "Business & Design",
			"level": "Advanced",
			"keywords": ["Product Strategy", "UI/UX Design", "Project Management", "Agile Development", "Scrum", "Business Analysis", "User Research", "Prototyping"]
		},
		{
			"name": "Data & Analytics",
			"level": "Intermediate",
			"keywords": ["Data Visualization", "Google Analytics", "Mixpanel", "Business Intelligence", "SQL Queries", "Performance Metrics", "A/B Testing"]
		},
		{
			"name": "E-commerce & Payments",
			"level": "Advanced",
			"keywords": ["Stripe", "PayPal", "Payment Processing", "E-commerce Platforms", "Shopping Cart Integration", "Subscription Management", "Inventory Systems"]
		}
	],

	"education": [
		{
			"institution": "Flatiron School, New York, NY",
			"area": "Software Engineering",
			"studyType": "Certification",
			"startDate": "2022",
			"endDate": "",
			"gpa": "",
			"courses": []
		},
		{
			"institution": "University of St Thomas, Minneapolis, MN",
			"area": "Project Management ",
			"studyType": "Certification",
			"startDate": "2014",
			"endDate": "",
			"gpa": "",
			"courses": []
		},
		{
			"institution": "Miami Ad School, South Beach, FL",
			"area": "Brand Strategy",
			"studyType": "Certification",
			"startDate": "2012",
			"endDate": "",
			"gpa": "",
			"courses": []
		},

		{
			"institution": "University of St Thomas, Minneapolis, MN",
			"area": "Business Entrepreneurship",
			"studyType": "B.A.",
			"startDate": "2005-09-01",
			"endDate": "2010-12-15",
			"gpa": "",
			"courses": []
		}
	],

	"work": [
		{
			"company": "WellVue",
			"position": "Lead Software Developer & Co-Founder",
			"website": "https://www.wellvue.co/",
			"startDate": "2023-01-01",
			"endDate": "Present",
			"summary": "Founded and led development of a comprehensive resident engagement platform transforming property management through mobile-first experiences. Built from concept to production serving 50+ properties and 5,000+ residents.",
			"highlights": [
				"Architected and built scalable React Native application serving multiple property types with real-time communication and push notifications",
				"Implemented Firebase backend architecture supporting thousands of users with 99.9% uptime and sub-200ms response times",
				"Reduced property management response times by 60% through automated workflows, digital maintenance requests, and resident communication tools",
				"Led product strategy and technical architecture decisions for rapid market expansion across residential, commercial, and student housing sectors",
				"Integrated payment processing, document management, and community features increasing resident engagement by 40%",
				"Managed full development lifecycle from MVP to production deployment with continuous integration and automated testing"
			]
		},
		{
			"company": "Fit By Jonetics",
			"position": "Full-Stack Developer & Technical Consultant",
			"website": "https://www.fitbyjonetics.com/",
			"startDate": "2023-01-01",
			"endDate": "2023-12-01",
			"summary": "Developed comprehensive fitness platform enabling personal trainers to scale their business through digital transformation. Delivered custom solution serving 200+ active users with 95% client satisfaction.",
			"highlights": [
				"Built custom WordPress platform with interactive workout builders, progress tracking, and client management system",
				"Integrated Stripe payment processing for seamless subscription and package billing, increasing revenue by 35%",
				"Implemented video streaming optimization for exercise demonstrations and tutorials with CDN integration",
				"Increased client retention rates by 25% through consistent digital engagement tools and automated follow-ups",
				"Developed responsive design ensuring optimal user experience across desktop, tablet, and mobile devices",
				"Created analytics dashboard providing insights into client engagement and program effectiveness"
			]
		},
		{
			"company": "Native Rank",
			"position": "Frontend Software Developer",
			"website": "https://www.nativerank.com/",
			"startDate": "2020-01-01",
			"endDate": "2022-12-01",
			"summary": "Developed responsive marketing solutions positioning businesses in front of qualified customers through strategic digital presence. Delivered 50+ client websites with measurable performance improvements.",
			"highlights": [
				"Developed responsive websites with cross-browser and cross-device compatibility using modern HTML5, CSS3, and JavaScript frameworks",
				"Implemented SEO strategies and technical optimizations increasing organic traffic by 150% and improving Core Web Vitals scores",
				"Managed ongoing website maintenance including content updates, security patches, and performance optimizations",
				"Collaborated with marketing teams to align technical solutions with business objectives and conversion goals",
				"Built custom WordPress themes and plugins tailored to client needs and industry requirements",
				"Integrated analytics tracking and conversion optimization tools resulting in 30% average improvement in lead generation"
			]
		},
		{
			"company": "USA2Kenya, LLC",
			"position": "Founder & Lead Software Developer",
			"website": "",
			"startDate": "2015-01-01",
			"endDate": "2019-03-15",
			"summary": "Founded and built innovative e-commerce platform providing US mailing addresses for international shoppers, successfully serving hundreds of customers globally. Achieved 40% month-over-month growth and processed $500K+ in package forwarding volume.",
			"highlights": [
				"Architected and developed full-stack Ruby on Rails application with integrated payment processing and inventory management",
				"Implemented complex logistics system managing international package forwarding with real-time tracking and customs documentation",
				"Built comprehensive customer management system handling user onboarding, payments, support tickets, and account management",
				"Successfully scaled business from concept to profitable operation with global customer base across 15+ countries",
				"Developed automated shipping calculations, customs duty estimation, and package consolidation algorithms",
				"Integrated with major shipping carriers (FedEx, UPS, DHL) and payment processors (Stripe, PayPal) for seamless operations"
			]
		},
		{
			"company": "Phoji, LLC",
			"position": "Mobile App Developer",
			"website": "",
			"startDate": "2015-08-01",
			"endDate": "2016-08-01",
			"summary": "Developed innovative mobile application creating real photo emojis, managing cloud infrastructure and user-generated content.",
			"highlights": [
				"Built mobile application for creating and sharing personalized photo emojis",
				"Maintained AWS cloud infrastructure ensuring data integrity and system reliability",
				"Collaborated on product development and feature ideation for user engagement",
				"Managed company website serving as primary marketing channel for app promotion"
			]
		},
		{
			"company": "United Health Group",
			"position": "Software Developer",
			"website": "",
			"startDate": "2015-01-01",
			"endDate": "2016-03-15",
			"summary": "Contributed to healthcare software solutions development in agile environment, focusing on CRM applications and user communication systems.",
			"highlights": [
				"Collaborated with cross-functional teams to develop healthcare-based software solutions",
				"Worked in agile development environment delivering features according to business requirements",
				"Built CRM application with SMS integration for automated user communication and data storage",
				"Participated in code reviews and knowledge sharing to maintain high development standards"
			]
		}
	],

	"certificates": [
		{
			"name": "Certified Professional Project Manager",
			"date": "2024",
			"issuer": "Opus School of Business",
			"url": "",
			"summary": "Earned certification demonstrating expertise in project management principles, methodologies, and practices, including planning, execution, and closing projects."
		},
		{
			"name": "Gen AI School",
			"date": "2024",
			"issuer": "Google for Startups",
			"url": "https://startup.google.com",
			"summary": "Participated in an immersive AI training program focused on Large Language Models (LLMs) and Google Cloud AI solutions. Developed AI-driven prototypes and applications, gaining insights into AI infrastructure and ethical practices."
		},
		{
			"name": "Software Engineering Certification",
			"date": "2022",
			"issuer": "Flatiron School",
			"url": "https://flatironschool.com",
			"summary": "Completed intensive full-stack software engineering program. Gained hands-on experience in React, Python, SQL, building applications and practicing agile methodologies."
		},
		{
			"name": "Cloud Data Analytics Certification",
			"date": "2023",
			"issuer": "Google",
			"url": "https://cloud.google.com",
			"summary": "Completed certification covering cloud data analysis (collection, processing, storage, analysis, visualization) using BigQuery, Cloud Storage, and Looker. Demonstrated proficiency in SQL and building BI dashboards."
		},
		{
			"name": "Project Management Professional (PMP) Preparation",
			"date": "2014",
			"issuer": "University of St Thomas",
			"url": "",
			"summary": "Comprehensive project management training covering PMI methodologies and best practices."
		},
		{
			"name": "Brand Strategy Certificate",
			"date": "2012",
			"issuer": "Miami Ad School",
			"url": "",
			"summary": "Strategic brand development and marketing communications certification."
		}
	],

	"volunteer": [
		{
			"organization": "Denver Tech Community",
			"position": "Mentor & Speaker",
			"website": "",
			"startDate": "2020-01-01",
			"endDate": "Present",
			"summary": "Mentor aspiring developers and entrepreneurs in the Denver tech community through workshops and one-on-one guidance.",
			"highlights": [
				"Conducted monthly workshops on React Native development and mobile app architecture",
				"Mentored 15+ junior developers in career development and technical skill building",
				"Spoke at local meetups and conferences about entrepreneurship and technology innovation",
				"Volunteered at coding bootcamps providing technical guidance and career advice"
			]
		},
		{
			"organization": "Code for America",
			"position": "Volunteer Developer",
			"website": "https://codeforamerica.org",
			"startDate": "2019-06-01",
			"endDate": "2020-12-01",
			"summary": "Contributed to civic technology projects improving government services and community engagement.",
			"highlights": [
				"Developed web applications for local government transparency and citizen engagement",
				"Collaborated with civic leaders to identify technology solutions for community challenges",
				"Built open-source tools for data visualization and public information access"
			]
		}
	],

	"publications": [
		{
			"name": "Building Scalable React Native Applications: A Developer's Guide",
			"publisher": "Personal Blog",
			"releaseDate": "2023-08-15",
			"url": "https://kebaara.com/essays/2025-08-04-scalable-react-native",
			"summary": "Comprehensive guide covering best practices for building scalable React Native applications with real-world examples from production apps."
		},
		{
			"name": "E-commerce Analytics Dashboard: Data-Driven Business Insights",
			"publisher": "Personal Blog", 
			"releaseDate": "2023-06-20",
			"url": "https://kebaara.com/essays/2025-06-20-ecommerce-analytics-dashboard",
			"summary": "Technical deep-dive into building analytics dashboards for e-commerce platforms with actionable insights and performance metrics."
		}
	],

	"references": [
		{
			"name": "Available upon request",
			"reference": ""
		}
	]
}
